artillery/scenarios/minimal-cache-test.yml
config:
  target: 'http://localhost:9000'
  phases:
    # Redis 캐시 프록시 테스트 - 최소 강도로 기능 테스트
    - duration: 30
      arrivalRate: 1
      name: "Proxy Cache - Minimal Warm-up"
    - duration: 60
      arrivalRate: 2
      name: "Proxy Cache - Light Testing"
    - duration: 60
      arrivalRate: 3
      name: "Proxy Cache - Normal Testing"
    - duration: 30
      arrivalRate: 5
      name: "Proxy Cache - Maximum Testing"
  http:
    timeout: 20
    pool: 10
    keepAlive: true
  payload:
    path: "../data/cache-test-data.csv"
    fields:
      - "cacheKey"
      - "region"
      - "deviceType"
  processor: "../processors/cache-metrics.js"

scenarios:
  - name: "Homepage Cache Performance"
    weight: 60
    flow:
      - get:
          url: "/"
          headers:
            X-Cache-Key: "{{ cacheKey }}"
            X-Device-Type: "{{ deviceType }}"
            X-Region: "{{ region }}"
          capture:
            - header: "x-cache-status"
              as: "cacheHitStatus"
            - header: "x-response-time"
              as: "proxyResponseTime"
            - header: "x-cache-ttl"
              as: "cacheTtl"
          expect:
            - statusCode: 200
            - contentType: "text/html"
          afterResponse: "analyzeCachePerformance"
          think:
            min: 2
            max: 5

  - name: "Categories Cache Performance"
    weight: 30
    flow:
      - get:
          url: "/categories"
          headers:
            X-Cache-Key: "{{ cacheKey }}"
            X-Device-Type: "{{ deviceType }}"
            X-Region: "{{ region }}"
          capture:
            - header: "x-cache-status"
              as: "cacheHitStatus"
            - header: "x-response-time"
              as: "proxyResponseTime"
          expect:
            - statusCode: 200
            - contentType: "text/html"
          afterResponse: "analyzeCachePerformance"
          think:
            min: 3
            max: 6

  - name: "Cache Invalidation Test"
    weight: 10
    flow:
      - get:
          url: "/"
          headers:
            Cache-Control: "no-cache"
          expect:
            - statusCode: 200
          think: 3
      - get:
          url: "/categories"
          headers:
            Cache-Control: "no-cache"
          expect:
            - statusCode: 200
          think: 2

# Redis 캐시 특화 메트릭
metrics:
  - name: "cache_hit_ratio"
    unit: "percentage"
  - name: "cache_response_time"
    unit: "milliseconds"
  - name: "cache_miss_penalty"
    unit: "milliseconds"
  - name: "redis_memory_usage"
    unit: "bytes"